RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* RCU_APB4RST */
#define RCU_APB4RST_SYSCFGRST           BIT(0)                                      /*!< SYSCFG reset */
#define RCU_APB4RST_CMPRST              BIT(1)                                      /*!< CMP reset */
#define RCU_APB4RST_VREFRST             BIT(2)                                      /*!< VREF reset */
#define RCU_APB4RST_LPDTSRST            BIT(3)                                      /*!< LPDTS reset */
#define RCU_APB4RST_PMURST              BIT(4)                                      /*!< PMU reset */

/* RCU_AHB1EN */
#define RCU_AHB1EN_ENET1EN              BIT(0)                                      /*!< ENET1 clock enable */
#define RCU_AHB1EN_ENET1TXEN            BIT(1)                                      /*!< ENET1 TX clock enable */
#define RCU_AHB1EN_ENET1RXEN            BIT(2)                                      /*!< ENET1 RX clock enable */
#define RCU_AHB1EN_ENET1PTPEN           BIT(3)                                      /*!< ENET1 PTP clock enable */
#define RCU_AHB1EN_USBHS0EN             BIT(14)                                     /*!< USBHS0 clock enable */
#define RCU_AHB1EN_USBHS0ULPIEN         BIT(15)                                     /*!< USBHS0 ULPI clock enable */
#define RCU_AHB1EN_DMA0EN               BIT(21)                                     /*!< DMA0 clock enable */
#define RCU_AHB1EN_DMA1EN               BIT(22)                                     /*!< DMA1 clock enable */
#define RCU_AHB1EN_DMAMUXEN             BIT(23)                                     /*!< DMAMUX clock enable */
#define RCU_AHB1EN_ENET0EN              BIT(25)                                     /*!< ENET0 clock enable */
#define RCU_AHB1EN_ENET0TXEN            BIT(26)                                     /*!< ENET0 TX clock enable */
#define RCU_AHB1EN_ENET0RXEN            BIT(27)                                     /*!< ENET0 RX clock enable */
#define RCU_AHB1EN_ENET0PTPEN           BIT(28)                                     /*!< ENET0 PTP clock enable */
#define RCU_AHB1EN_USBHS1EN             BIT(29)                                     /*!< USBHS1 clock enable */
#define RCU_AHB1EN_USBHS1ULPIEN         BIT(30)                                     /*!< USBHS1 ULPI clock enable */

/* RCU_AHB2EN */
#define RCU_AHB2EN_DCIEN                BIT(0)                                      /*!< DCI clock enable */
#define RCU_AHB2EN_FACEN                BIT(1)                                      /*!< FAC clock enable */
#define RCU_AHB2EN_SDIO1EN              BIT(2)                                      /*!< SDIO1 clock enable */
#define RCU_AHB2EN_CAUEN                BIT(3)                                      /*!< CAU clock enable */
#define RCU_AHB2EN_HAUEN                BIT(4)                                      /*!< HAU clock enable */
#define RCU_AHB2EN_GPSIEN               BIT(5)                                      /*!< GPSI clock enable */
#define RCU_AHB2EN_TRNGEN               BIT(6)                                      /*!< TRNG clock enable */
#define RCU_AHB2EN_TMUEN                BIT(7)                                      /*!< TMU clock enable */
#define RCU_AHB2EN_RAMECCMU1EN          BIT(8)                                      /*!< RAMECCMU1 clock enable */
#define RCU_AHB2EN_PKCAUEN              BIT(9)                                      /*!< PKCAU clock enable */
#define RCU_AHB2EN_FFTEN                BIT(10)                                     /*!< FFT clock enable */
#define RCU_AHB2EN_ESCEN                BIT(12)                                     /*!< ESC clock enable */

/* RCU_AHB3EN */
#define RCU_AHB3EN_EXMCEN               BIT(0)                                      /*!< EXMC clock enable */
#define RCU_AHB3EN_IPAEN                BIT(1)                                      /*!< IPA clock enable */
#define RCU_AHB3EN_SDIO0EN              BIT(2)                                      /*!< SDIO0 clock enable */
#define RCU_AHB3EN_MDMAEN               BIT(3)                                      /*!< MDMA clock enable */
#define RCU_AHB3EN_OSPIMEN              BIT(4)                                      /*!< OSPIM clock enable */
#define RCU_AHB3EN_OSPI0EN              BIT(5)                                      /*!< OSPI0 clock enable */
#define RCU_AHB3EN_OSPI1EN              BIT(6)                                      /*!< OSPI1 clock enable */
#define RCU_AHB3EN_DSIEN                BIT(7)                                      /*!< DSI clock enable */
#define RCU_AHB3EN_RTDEC0EN             BIT(8)                                      /*!< RTDEC0 clock enable */
#define RCU_AHB3EN_RTDEC1EN             BIT(9)                                      /*!< RTDEC1 clock enable */
#define RCU_AHB3EN_RAMECCMU0EN          BIT(10)                                     /*!< RAMECCMU0 clock enable */
#define RCU_AHB3EN_CPUEN                BIT(15)                                     /*!< CPU clock enable */

/* RCU_AHB4EN */
#define RCU_AHB4EN_PAEN                 BIT(0)                                      /*!< GPIO port A enable */
#define RCU_AHB4EN_PBEN                 BIT(1)                                      /*!< GPIO port B enable */
#define RCU_AHB4EN_PCEN                 BIT(2)                                      /*!< GPIO port C enable */
#define RCU_AHB4EN_PDEN                 BIT(3)                                      /*!< GPIO port D enable */
#define RCU_AHB4EN_PEEN                 BIT(4)                                      /*!< GPIO port E enable */
#define RCU_AHB4EN_PFEN                 BIT(5)                                      /*!< GPIO port F enable */
#define RCU_AHB4EN_PGEN                 BIT(6)                                      /*!< GPIO port G enable */
#define RCU_AHB4EN_PHEN                 BIT(7)                                      /*!< GPIO port H enable */
#define RCU_AHB4EN_PJEN                 BIT(8)                                      /*!< GPIO port J enable */
#define RCU_AHB4EN_PKEN                 BIT(9)                                      /*!< GPIO port K enable */
#define RCU_AHB4EN_BKPSRAMEN            BIT(13)                                     /*!< Backup SRAM enable */
#define RCU_AHB4EN_CRCEN                BIT(14)                                     /*!< CRC enable */
#define RCU_AHB4EN_HWSEMEN              BIT(15)                                     /*!< HWSEM enable */

/* RCU_APB1EN */
#define RCU_APB1EN_TIMER1EN             BIT(0)                                      /*!< TIMER1 enable */
#define RCU_APB1EN_TIMER2EN             BIT(1)                                      /*!< TIMER2 enable */
#define RCU_APB1EN_TIMER3EN             BIT(2)                                      /*!< TIMER3 enable */
#define RCU_APB1EN_TIMER4EN             BIT(3)                                      /*!< TIMER4 enable */
#define RCU_APB1EN_TIMER5EN             BIT(4)                                      /*!< TIMER5 enable */
#define RCU_APB1EN_TIMER6EN             BIT(5)                                      /*!< TIMER6 enable */
#define RCU_APB1EN_TIMER22EN            BIT(6)                                      /*!< TIMER22 enable */
#define RCU_APB1EN_TIMER23EN            BIT(7)                                      /*!< TIMER23 enable */
#define RCU_APB1EN_TIMER30EN            BIT(8)                                      /*!< TIMER30 enable */
#define RCU_APB1EN_TIMER31EN            BIT(9)                                      /*!< TIMER31 enable */
#define RCU_APB1EN_TIMER50EN            BIT(10)                                     /*!< TIMER50 enable */
#define RCU_APB1EN_TIMER51EN            BIT(11)                                     /*!< TIMER51 enable */
#define RCU_APB1EN_RSPDIFEN             BIT(13)                                     /*!< RSPDIF enable */
#define RCU_APB1EN_SPI1EN               BIT(14)                                     /*!< SPI1 enable */
#define RCU_APB1EN_SPI2EN               BIT(15)                                     /*!< SPI2 enable */
#define RCU_APB1EN_MDIOEN               BIT(16)                                     /*!< MDIO enable */
#define RCU_APB1EN_USART1EN             BIT(17)                                     /*!< USART1 enable */
#define RCU_APB1EN_USART2EN             BIT(18)                                     /*!< USART2 enable */
#define RCU_APB1EN_UART3EN              BIT(19)                                     /*!< UART3 enable */
#define RCU_APB1EN_UART4EN              BIT(20)                                     /*!< UART4 enable */
#define RCU_APB1EN_I2C0EN               BIT(21)                                     /*!< I2C0 enable */
#define RCU_APB1EN_I2C1EN               BIT(22)                                     /*!< I2C1 enable */
#define RCU_APB1EN_I2C2EN               BIT(23)                                     /*!< I2C2 enable */
#define RCU_APB1EN_I2C3EN               BIT(24)                                     /*!< I2C3 enable */
#define RCU_APB1EN_CTCEN                BIT(27)                                     /*!< CTC enable */
#define RCU_APB1EN_DACHOLDEN            BIT(28)                                     /*!< DAC hold clock enable */
#define RCU_APB1EN_DACEN                BIT(29)                                     /*!< DAC enable */
#define RCU_APB1EN_UART6EN              BIT(30)                                     /*!< UART6 enable */
#define RCU_APB1EN_UART7EN              BIT(31)                                     /*!< UART7 enable */

/* RCU_APB2EN */
#define RCU_APB2EN_TIMER0EN             BIT(0)                                      /*!< TIMER0 enable */
#define RCU_APB2EN_TIMER7EN             BIT(1)                                      /*!< TIMER7 enable */
#define RCU_APB2EN_USART0EN             BIT(4)                                      /*!< USART0 enable */
#define RCU_APB2EN_USART5EN             BIT(5)                                      /*!< USART5 enable */
#define RCU_APB2EN_ADC0EN               BIT(8)                                      /*!< ADC0 enable */
#define RCU_APB2EN_ADC1EN               BIT(9)                                      /*!< ADC1 enable */
#define RCU_APB2EN_ADC2EN               BIT(10)                                     /*!< ADC2 enable */
#define RCU_APB2EN_SPI0EN               BIT(12)                                     /*!< SPI0 enable */
#define RCU_APB2EN_SPI3EN               BIT(13)                                     /*!< SPI3 enable */
#define RCU_APB2EN_SAI3EN               BIT(15)                                     /*!< SAI3 enable */
#define RCU_APB2EN_TIMER14EN            BIT(16)                                     /*!< TIMER14 enable */
#define RCU_APB2EN_TIMER15EN            BIT(17)                                     /*!< TIMER15 enable */
#define RCU_APB2EN_TIMER16EN            BIT(18)                                     /*!< TIMER16 enable */
#define RCU_APB2EN_HPDFEN               BIT(19)                                     /*!< HPDF enable */
#define RCU_APB2EN_SPI4EN               BIT(20)                                     /*!< SPI4 enable */
#define RCU_APB2EN_SPI5EN               BIT(21)                                     /*!< SPI5 enable */
#define RCU_APB2EN_SAI0EN               BIT(22)                                     /*!< SAI0 enable */
#define RCU_APB2EN_SAI1EN               BIT(23)                                     /*!< SAI1 enable */
#define RCU_APB2EN_SAI2EN               BIT(24)                                     /*!< SAI2 enable */
#define RCU_APB2EN_TIMER40EN            BIT(25)                                     /*!< TIMER40 enable */
#define RCU_APB2EN_TIMER41EN            BIT(26)                                     /*!< TIMER41 enable */
#define RCU_APB2EN_TIMER42EN            BIT(27)                                     /*!< TIMER42 enable */
#define RCU_APB2EN_TIMER43EN            BIT(28)                                     /*!< TIMER43 enable */
#define RCU_APB2EN_TIMER44EN            BIT(29)                                     /*!< TIMER44 enable */
#define RCU_APB2EN_EDOUTEN              BIT(30)                                     /*!< EDOUT enable */
#define RCU_APB2EN_TRGSELEN             BIT(31)                                     /*!< TRGSEL enable */

