RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* RCU_APB2SPEN */
#define RCU_APB2SPEN_TIMER0SPEN         BIT(0)                                      /*!< TIMER0 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER7SPEN         BIT(1)                                      /*!< TIMER7 clock enable when sleep mode*/
#define RCU_APB2SPEN_USART0SPEN         BIT(4)                                      /*!< USART0 clock enable when sleep mode*/
#define RCU_APB2SPEN_USART5SPEN         BIT(5)                                      /*!< USART5 clock enable when sleep mode*/
#define RCU_APB2SPEN_ADC0SPEN           BIT(8)                                      /*!< ADC0 clock enable when sleep mode*/
#define RCU_APB2SPEN_ADC1SPEN           BIT(9)                                      /*!< ADC1 clock enable when sleep mode*/
#define RCU_APB2SPEN_ADC2SPEN           BIT(10)                                     /*!< ADC2 clock enable when sleep mode*/
#define RCU_APB2SPEN_SPI0SPEN           BIT(12)                                     /*!< SPI0 clock enable when sleep mode*/
#define RCU_APB2SPEN_SPI3SPEN           BIT(13)                                     /*!< SPI3 clock enable when sleep mode*/
#define RCU_APB2SPEN_SAI3SPEN           BIT(15)                                     /*!< SAI3 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER14SPEN        BIT(16)                                     /*!< TIMER14 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER15SPEN        BIT(17)                                     /*!< TIMER15 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER16SPEN        BIT(18)                                     /*!< TIMER16 clock enable when sleep mode*/
#define RCU_APB2SPEN_HPDFSPEN           BIT(19)                                     /*!< HPDF clock enable when sleep mode*/
#define RCU_APB2SPEN_SPI4SPEN           BIT(20)                                     /*!< SPI4 clock enable when sleep mode*/
#define RCU_APB2SPEN_SPI5SPEN           BIT(21)                                     /*!< SPI5 clock enable when sleep mode*/
#define RCU_APB2SPEN_SAI0SPEN           BIT(22)                                     /*!< SAI0 clock enable when sleep mode*/
#define RCU_APB2SPEN_SAI1SPEN           BIT(23)                                     /*!< SAI1 clock enable when sleep mode*/
#define RCU_APB2SPEN_SAI2SPEN           BIT(24)                                     /*!< SAI2 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER40SPEN        BIT(25)                                     /*!< TIMER40 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER41SPEN        BIT(26)                                     /*!< TIMER41 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER42SPEN        BIT(27)                                     /*!< TIMER42 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER43SPEN        BIT(28)                                     /*!< TIMER43 clock enable when sleep mode*/
#define RCU_APB2SPEN_TIMER44SPEN        BIT(29)                                     /*!< TIMER44 clock enable when sleep mode*/
#define RCU_APB2SPEN_EDOUTSPEN          BIT(30)                                     /*!< EDOUT clock enable when sleep mode*/
#define RCU_APB2SPEN_TRIGSELSPEN        BIT(31)                                     /*!< TRIGSEL clock enable when sleep mode*/

/* RCU_APB3SPEN */
#define RCU_APB3SPEN_TLISPEN            BIT(0)                                      /*!< TLI clock enable when sleep mode*/
#define RCU_APB3SPEN_WWDGTSPEN          BIT(1)                                      /*!< WWDGT clock enable when sleep mode*/

/* RCU_APB4SPEN */
#define RCU_APB4SPEN_SYSCFGSPEN         BIT(0)                                      /*!< SYSCFG clock enable when sleep mode*/
#define RCU_APB4SPEN_CMPSPEN            BIT(1)                                      /*!< CMP clock enable when sleep mode*/
#define RCU_APB4SPEN_VREFSPEN           BIT(2)                                      /*!< VREF clock enable when sleep mode*/
#define RCU_APB4SPEN_LPDTSSPEN          BIT(3)                                      /*!< LPDTS clock enable when sleep mode*/
#define RCU_APB4SPEN_PMUSPEN            BIT(4)                                      /*!< PMU clock enable when sleep mode*/

/* RCU_BDCTL */
#define RCU_BDCTL_LXTALEN               BIT(0)                                      /*!< LXTAL enable */
#define RCU_BDCTL_LXTALSTB              BIT(1)                                      /*!< low speed crystal oscillator stabilization flag */
#define RCU_BDCTL_LXTALBPS              BIT(2)                                      /*!< LXTAL bypass mode enable */
#define RCU_BDCTL_LXTALDRI              BITS(3,4)                                   /*!< LXTAL drive capability */
#define RCU_BDCTL_LCKMEN                BIT(5)                                      /*!< LXTAL clock monitor enable */
#define RCU_BDCTL_LCKMD                 BIT(6)                                      /*!< LXTAL clock failure detection flag */
#define RCU_BDCTL_LXTALRDYRST           BIT(7)                                      /*!< LXTAL ready reset */
#define RCU_BDCTL_RTCSRC                BITS(8,9)                                   /*!< RTC clock entry selection */
#define RCU_BDCTL_LXTALSTARTON          BIT(10)                                     /*!< LXTAL start circuit on control */
#define RCU_BDCTL_RTCEN                 BIT(15)                                     /*!< RTC clock enable */
#define RCU_BDCTL_BKPRST                BIT(16)                                     /*!< backup domain reset */

/* RCU_RSTSCK */
#define RCU_RSTSCK_IRC32KEN             BIT(0)                                      /*!< IRC32K enable */
#define RCU_RSTSCK_IRC32KSTB            BIT(1)                                      /*!< IRC32K stabilization flag */
#define RCU_RSTSCK_RSTFC                BIT(24)                                     /*!< reset flag clear */
#define RCU_RSTSCK_BORRSTF              BIT(25)                                     /*!< BOR reset flag */
#define RCU_RSTSCK_EPRSTF               BIT(26)                                     /*!< external pin reset flag */
#define RCU_RSTSCK_PORRSTF              BIT(27)                                     /*!< power reset flag */
#define RCU_RSTSCK_SWRSTF               BIT(28)                                     /*!< software reset flag */
#define RCU_RSTSCK_FWDGTRSTF            BIT(29)                                     /*!< free watchdog timer reset flag */
#define RCU_RSTSCK_WWDGTRSTF            BIT(30)                                     /*!< window watchdog timer reset flag */
#define RCU_RSTSCK_LPRSTF               BIT(31)                                     /*!< low-power reset flag */

/* RCU_PLLADDCTL */
#define RCU_PLLADDCTL_PLL0Q             BITS(0,6)                                   /*!< the PLL0Q output frequency division factor from PLL0 VCO clock */
#define RCU_PLLADDCTL_PLL1Q             BITS(8,14)                                  /*!< the PLL1Q output frequency division factor from PLL1 VCO clock */
#define RCU_PLLADDCTL_PLL2Q             BITS(16,22)                                 /*!< the PLL2Q output frequency division factor from PLL2 VCO clock */
#define RCU_PLLADDCTL_PLL0QEN           BIT(23)                                     /*!< PLL0Q divider output enable */
#define RCU_PLLADDCTL_PLL0REN           BIT(24)                                     /*!< PLL0R divider output enable */
#define RCU_PLLADDCTL_PLL0PEN           BIT(25)                                     /*!< PLL0P divider output enable */
#define RCU_PLLADDCTL_PLL1QEN           BIT(26)                                     /*!< PLL1Q divider output enable */
#define RCU_PLLADDCTL_PLL1REN           BIT(27)                                     /*!< PLL1R divider output enable */
#define RCU_PLLADDCTL_PLL1PEN           BIT(28)                                     /*!< PLL1P divider output enable */
#define RCU_PLLADDCTL_PLL2QEN           BIT(29)                                     /*!< PLL2Q divider output enable */
#define RCU_PLLADDCTL_PLL2REN           BIT(30)                                     /*!< PLL2R divider output enable */
#define RCU_PLLADDCTL_PLL2PEN           BIT(31)                                     /*!< PLL2P divider output enable */

/* RCU_PLL1 */
#define RCU_PLL1_PLL1PSC                BITS(0,5)                                   /*!< the PLL1 VCO source clock prescaler */
#define RCU_PLL1_PLL1N                  BITS(6,14)                                  /*!< the PLL1 VCO clock multi factor */
#define RCU_PLL1_PLL1P                  BITS(16,22)                                 /*!< the PLL1P output frequency division factor from PLL1 VCO clock */
#define RCU_PLL1_PLL1R                  BITS(24,30)                                 /*!< the PLL1R output frequency division factor from PLL1 VCO clock */

