RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* RCU_ADDCTL1 */
#define RCU_ADDCTL1_LPIRC4MEN           BIT(0)                                      /*!< LPIRC4M clock enable */
#define RCU_ADDCTL1_LPIRC4MSTB          BIT(1)                                      /*!< LPIRC4M clock stabilization flag */
#define RCU_ADDCTL1_LPIRC4MADJ          BITS(2,7)                                   /*!< LPIRC4M clock trim adjust value */
#define RCU_ADDCTL1_LPIRC4MCAL          BITS(8,15)                                  /*!< LPIRC4M clock calibration value */
#define RCU_ADDCTL1_IRC64MDIV           BITS(16,17)                                 /*!< IRC64M clock divider */
#define RCU_ADDCTL1_LPIRC4MDSPEN        BIT(20)                                     /*!< LPIRC4M clock enable in deepsleep mode */
#define RCU_ADDCTL1_PLLUSBHS0EN         BIT(28)                                     /*!< PLLUSBHS0 clock enable */
#define RCU_ADDCTL1_PLLUSBHS0STB        BIT(29)                                     /*!< PLLUSBHS0 clock stabilization flag */

/* RCU_ADDINT */
#define RCU_ADDINT_PLLUSBHS0STBIF       BIT(4)                                      /*!< Internal PLL of USBHS0 stabilization interrupt flag */
#define RCU_ADDINT_IRC48MSTBIF          BIT(6)                                      /*!< IRC48M stabilization interrupt flag */
#define RCU_ADDINT_PLLUSBHS0STBIE       BIT(12)                                     /*!< Internal PLL of USBHS0 stabilization interrupt enable */
#define RCU_ADDINT_IRC48MSTBIE          BIT(14)                                     /*!< Internal 48 MHz RC oscillator stabilization interrupt enable */
#define RCU_ADDINT_PLLUSBHS0STBIC       BIT(20)                                     /*!< Internal PLL of USBHS0 stabilization interrupt clear */
#define RCU_ADDINT_IRC48MSTBIC          BIT(22)                                     /*!< Internal 48 MHz RC oscillator stabilization interrupt clear */

/* RCU_CFG4 */
#define RCU_CFG4_SDIO0SEL               BIT(0)                                      /*!< SDIO0 clock source selection */
#define RCU_CFG4_OSPISEL                BITS(1,2)                                   /*!< OSPI clock source selection */
#define RCU_CFG4_EXMCSEL                BITS(8,9)                                   /*!< EXMC clock source selection */

/* RCU_USBCLKCTL*/
#define RCU_USBCLKCTL_USBHS0SEL         BIT(1)                                      /*!< USBHS0 clock selection */
#define RCU_USBCLKCTL_PLLUSBHS0PRESEL   BIT(3)                                      /*!< PLLUSBHS0 clock source selection */
#define RCU_USBCLKCTL_USBHS0SWEN        BIT(4)                                      /*!< USBHS0 clock source selection enable */
#define RCU_USBCLKCTL_USBHS048MSEL      BITS(5,6)                                   /*!< USBHS0 48M clock source selection */
#define RCU_USBCLKCTL_USBHS148MSEL      BITS(13,14)                                 /*!< USBHS1 48M clock source selection */
#define RCU_USBCLKCTL_USBHS0PSC         BITS(16,18)                                 /*!< USBHS0 clock prescaler selection */
#define RCU_USBCLKCTL_USBHS1PSC         BITS(19,21)                                 /*!< USBHS1 clock prescaler selection */

/* RCU_PLLUSBCFG*/
#define RCU_PLLUSBCFG_PLLUSBHS0PREDV    BITS(0,3)                                   /*!< the PLLUSBHS0PREDV clock prescaler */
#define RCU_PLLUSBCFG_USBHS0DV          BITS(4,6)                                   /*!< USBHS0 clock divider */
#define RCU_PLLUSBCFG_PLLUSBHS0MF       BITS(8,14)                                  /*!< the PLLUSBHS0 clock multiplication factor */

/* RCU_ADDAPB2RST */
#define RCU_ADDAPB2RST_CAN0RST          BIT(0)                                      /*!< CAN0 reset */
#define RCU_ADDAPB2RST_CAN1RST          BIT(1)                                      /*!< CAN1 reset */
#define RCU_ADDAPB2RST_CAN2RST          BIT(2)                                      /*!< CAN2 reset */
#define RCU_ADDAPB2RST_AFMTRST          BIT(16)                                     /*!< AFMT reset */
#define RCU_ADDAPB2RST_TFMTRST          BIT(17)                                     /*!< TFMT reset */
#define RCU_ADDAPB2RST_ENDATRST         BIT(18)                                     /*!< ENDAT reset */
#define RCU_ADDAPB2RST_BISSRST          BIT(19)                                     /*!< BISS reset */
#define RCU_ADDAPB2RST_HDSLRST          BIT(20)                                     /*!< HDSL reset */
#define RCU_ADDAPB2RST_RDCMRST          BIT(21)                                     /*!< RDCM reset */

/* RCU_ADDAPB2EN */
#define RCU_ADDAPB2EN_CAN0EN            BIT(0)                                      /*!< CAN0 clock enable */
#define RCU_ADDAPB2EN_CAN1EN            BIT(1)                                      /*!< CAN1 clock enable */
#define RCU_ADDAPB2EN_CAN2EN            BIT(2)                                      /*!< CAN2 clock enable */
#define RCU_ADDAPB2EN_AFMTEN            BIT(16)                                     /*!< AFMT clock enable */
#define RCU_ADDAPB2EN_TFMTEN            BIT(17)                                     /*!< TFMT clock enable */
#define RCU_ADDAPB2EN_ENDATEN           BIT(18)                                     /*!< ENDAT clock enable */
#define RCU_ADDAPB2EN_BISSEN            BIT(19)                                     /*!< BISS clock enable */
#define RCU_ADDAPB2EN_HDSLEN            BIT(20)                                     /*!< HDSL clock enable */
#define RCU_ADDAPB2EN_RDCMEN            BIT(21)                                     /*!< RDCM clock enable */

/* RCU_ADDAPB2SPEN */
#define RCU_ADDAPB2SPEN_CAN0SPEN        BIT(0)                                      /*!< CAN0 clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_CAN1SPEN        BIT(1)                                      /*!< CAN1 clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_CAN2SPEN        BIT(2)                                      /*!< CAN2 clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_AFMTSPEN        BIT(16)                                     /*!< AFMT clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_TFMTSPEN        BIT(17)                                     /*!< TFMT clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_ENDATSPEN       BIT(18)                                     /*!< ENDAT clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_BISSSPEN        BIT(19)                                     /*!< BISS clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_HDSLSPEN        BIT(20)                                     /*!< HDSL clock enable when sleep mode */
#define RCU_ADDAPB2SPEN_RDCMSPEN        BIT(21)                                     /*!< RDCM clock enable when sleep mode */

/* RCU_CFG5 */
#define RCU_CFG5_SPI0SEL                BITS(0,2)                                   /*!< SPI0 and I2S0 clock source selection */
#define RCU_CFG5_SPI1SEL                BITS(4,6)                                   /*!< SPI1 and I2S1 clock source selection */
#define RCU_CFG5_SPI2SEL                BITS(8,10)                                  /*!< SPI2 and I2S2 clock source selection */
#define RCU_CFG5_SPI3SEL                BITS(12,14)                                 /*!< SPI3 clock source selection */
#define RCU_CFG5_SPI4SEL                BITS(16,18)                                 /*!< SPI4 clock source selection */
#define RCU_CFG5_SPI5SEL                BITS(20,22)                                 /*!< SPI5 and I2S5 clock source selection */

/* RCU_CFG6 */
#define RCU_CFG6_ENCODERSEL             BITS(0,1)                                   /*!< ENCODER clock source selection select */
#define RCU_CFG6_HDSLSEL                BITS(2,3)                                   /*!< HDSL clock source selection select */
#define RCU_CFG6_AFMTDIV                BITS(4,7)                                   /*!< AFMT divider */
#define RCU_CFG6_TFMTDIV                BITS(8,11)                                  /*!< TFMT divider */
#define RCU_CFG6_ENDATDIV               BITS(12,15)                                 /*!< ENDAT divider */
#define RCU_CFG6_HDSLDIV                BITS(24,26)                                 /*!< HDSL divider */

/* RCU_CKFMCFG0 */
#define RCU_CKFMCFG0_IRC64MCKFMEN       BIT(0)                                      /*!< IRC64M clock frequency monitor enable */
#define RCU_CKFMCFG0_IRC64MCKFMC        BITS(1,2)                                   /*!< IRC64M clock frequency monitor configuration */
#define RCU_CKFMCFG0_IRC64MCKFFF        BIT(3)                                      /*!< IRC64M clock frequency failure flag */
#define RCU_CKFMCFG0_IRC64MCKFFC        BIT(4)                                      /*!< IRC64M clock frequency failure flag clear */
#define RCU_CKFMCFG0_IRC64MCKFFIE       BIT(5)                                      /*!< IRC64M clock frequency failure interrupt enable */
#define RCU_CKFMCFG0_LPIRC4MCKFMEN      BIT(16)                                     /*!< LPIRC4M clock frequency monitor enable */
#define RCU_CKFMCFG0_LPIRC4MCKFMC       BITS(17,18)                                 /*!< LPIRC4M clock frequency monitor configuration */
#define RCU_CKFMCFG0_LPIRC4MCKFFF       BIT(19)                                     /*!< LPIRC4M clock frequency failure flag */
#define RCU_CKFMCFG0_LPIRC4MCKFFC       BIT(20)                                     /*!< LPIRC4M clock frequency failure flag clear */
#define RCU_CKFMCFG0_LPIRC4MCKFFIE      BIT(21)                                     /*!< LPIRC4M clock frequency failure flag interrupt enable */

