RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* clock monitor configuration register */
#define CKFMCFG0_REG_OFFSET             ((uint32_t)0x000000F4U)                     /*!< clock frequency monitor configuration 0 register offset */
#define CKFMCFG1_REG_OFFSET             ((uint32_t)0x000000F8U)                     /*!< clock frequency monitor configuration 1 register offset */
#define CKFMCFG2_REG_OFFSET             ((uint32_t)0x000000FCU)                     /*!< clock frequency monitor configuration 2 register offset */

/* peripheral clock enable */
typedef enum {
    /* AHB1 peripherals */
    RCU_ENET1      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 0U),                         /*!< ENET1 clock */
    RCU_ENET1TX    = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 1U),                         /*!< ENET1 TX clock */
    RCU_ENET1RX    = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 2U),                         /*!< ENET1 RX clock */
    RCU_ENET1PTP   = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 3U),                         /*!< ENET1 PTP clock */
    RCU_USBHS0     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 14U),                        /*!< USBHS0 clock */
    RCU_USBHS0ULPI = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 15U),                        /*!< USBHS0 ULPI clock */
    RCU_DMA0       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 21U),                        /*!< DMA0 clock */
    RCU_DMA1       = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 22U),                        /*!< DMA1 clock */
    RCU_DMAMUX     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 23U),                        /*!< DMAMUX clock */
    RCU_ENET0      = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 25U),                        /*!< ENET0 clock */
    RCU_ENET0TX    = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 26U),                        /*!< ENET0 TX clock */
    RCU_ENET0RX    = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 27U),                        /*!< ENET0 RX clock */
    RCU_ENET0PTP   = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 28U),                        /*!< ENET0 PTP clock */
    RCU_USBHS1     = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 29U),                        /*!< USBHS1 clock */
    RCU_USBHS1ULPI = RCU_REGIDX_BIT(AHB1EN_REG_OFFSET, 30U),                        /*!< USBHS1 ULPI clock */
    /* AHB2 peripherals */
    RCU_DCI        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 0U),                         /*!< DCI clock */
    RCU_FAC        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 1U),                         /*!< FAC clock */
    RCU_SDIO1      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 2U),                         /*!< SDIO1 clock */
    RCU_CAU        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 3U),                         /*!< CAU clock */
    RCU_HAU        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 4U),                         /*!< HAU clock */
    RCU_GPSI       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 5U),                         /*!< GPSI clock */
    RCU_TRNG       = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 6U),                         /*!< TRNG clock */
    RCU_TMU        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 7U),                         /*!< TMU clock */
    RCU_RAMECCMU1  = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 8U),                         /*!< RAMECCMU1 clock */
    RCU_PKCAU      = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 9U),                         /*!< PKACAU clock */
    RCU_FFT        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 10U),                        /*!< FFT clock */
    RCU_ESC        = RCU_REGIDX_BIT(AHB2EN_REG_OFFSET, 12U),                        /*!< ESC clock */
    /* AHB3 peripherals */
    RCU_EXMC       = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 0U),                         /*!< EXMC clock */
    RCU_IPA        = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 1U),                         /*!< IPA clock */
    RCU_SDIO0      = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 2U),                         /*!< SDIO0 clock */
    RCU_MDMA       = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 3U),                         /*!< MDMA clock */
    RCU_OSPIM      = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 4U),                         /*!< OSPIM clock */
    RCU_OSPI0      = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 5U),                         /*!< OSPI0 clock */
    RCU_OSPI1      = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 6U),                         /*!< OSPI1 clock */
    RCU_DSI        = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 7U),                         /*!< DSI clock */
    RCU_RTDEC0     = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 8U),                         /*!< RTDEC0 clock */
    RCU_RTDEC1     = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 9U),                         /*!< RTDEC1 clock */
    RCU_RAMECCMU0  = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 10U),                        /*!< RAMECCMU0 clock */
    RCU_CPU        = RCU_REGIDX_BIT(AHB3EN_REG_OFFSET, 15U),                        /*!< CPU clock */
    /* AHB4 peripherals */
    RCU_GPIOA      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 0U),                         /*!< GPIOA clock */
    RCU_GPIOB      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 1U),                         /*!< GPIOB clock */
    RCU_GPIOC      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 2U),                         /*!< GPIOC clock */
    RCU_GPIOD      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 3U),                         /*!< GPIOD clock */
    RCU_GPIOE      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 4U),                         /*!< GPIOE clock */
    RCU_GPIOF      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 5U),                         /*!< GPIOF clock */
    RCU_GPIOG      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 6U),                         /*!< GPIOG clock */
    RCU_GPIOH      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 7U),                         /*!< GPIOH clock */
    RCU_GPIOJ      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 8U),                         /*!< GPIOJ clock */
    RCU_GPIOK      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 9U),                         /*!< GPIOK clock */
    RCU_BKPSRAM    = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 13U),                        /*!< BKPSRAM clock */
    RCU_CRC        = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 14U),                        /*!< CRC clock */
    RCU_HWSEM      = RCU_REGIDX_BIT(AHB4EN_REG_OFFSET, 15U),                        /*!< HWSEM  clock */
    /* APB1 peripherals */
    RCU_TIMER1     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 0U),                         /*!< TIMER1 clock */
    RCU_TIMER2     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 1U),                         /*!< TIMER2 clock */
    RCU_TIMER3     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 2U),                         /*!< TIMER3 clock */
    RCU_TIMER4     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 3U),                         /*!< TIMER4 clock */
    RCU_TIMER5     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 4U),                         /*!< TIMER5 clock */
    RCU_TIMER6     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 5U),                         /*!< TIMER6 clock */
    RCU_TIMER22    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 6U),                         /*!< TIMER22 clock */
    RCU_TIMER23    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 7U),                         /*!< TIMER23 clock */
    RCU_TIMER30    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 8U),                         /*!< TIMER30 clock */
    RCU_TIMER31    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 9U),                         /*!< TIMER31 clock */
    RCU_TIMER50    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 10U),                        /*!< TIMER50 clock */
    RCU_TIMER51    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 11U),                        /*!< TIMER51 clock */
    RCU_RSPDIF     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 13U),                        /*!< RSPDIF clock */
    RCU_SPI1       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 14U),                        /*!< SPI1 clock */
    RCU_SPI2       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 15U),                        /*!< SPI2 clock */
    RCU_MDIO       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 16U),                        /*!< MDIO clock */
    RCU_USART1     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 17U),                        /*!< USART1 clock */
    RCU_USART2     = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 18U),                        /*!< USART2 clock */
    RCU_UART3      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 19U),                        /*!< UART3 clock */
    RCU_UART4      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 20U),                        /*!< UART4 clock */
    RCU_I2C0       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 21U),                        /*!< I2C0 clock */
    RCU_I2C1       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 22U),                        /*!< I2C1 clock */
    RCU_I2C2       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 23U),                        /*!< I2C2 clock */
    RCU_I2C3       = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 24U),                        /*!< I2C3 clock */
    RCU_CTC        = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 27U),                        /*!< CTC clock */
    RCU_DACHOLD    = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 28U),                        /*!< DACHOLD clock */
    RCU_DAC        = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 29U),                        /*!< DAC clock */
    RCU_UART6      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 30U),                        /*!< UART6 clock */
    RCU_UART7      = RCU_REGIDX_BIT(APB1EN_REG_OFFSET, 31U),                        /*!< UART7 clock */
    /* APB2 peripherals */
    RCU_TIMER0     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 0U),                         /*!< TIMER0 clock */
    RCU_TIMER7     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 1U),                         /*!< TIMER7 clock */
    RCU_USART0     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 4U),                         /*!< USART0 clock */
    RCU_USART5     = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 5U),                         /*!< USART5 clock */
    RCU_ADC0       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 8U),                         /*!< ADC0 clock */
    RCU_ADC1       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 9U),                         /*!< ADC1 clock */
    RCU_ADC2       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 10U),                        /*!< ADC2 clock */
    RCU_SPI0       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 12U),                        /*!< SPI0 clock */
    RCU_SPI3       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 13U),                        /*!< SPI3 clock */
    RCU_SAI3       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 15U),                        /*!< SAI3 clock */
    RCU_TIMER14    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 16U),                        /*!< TIMER14 clock */
    RCU_TIMER15    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 17U),                        /*!< TIMER15 clock */
    RCU_TIMER16    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 18U),                        /*!< TIMER16 clock */
    RCU_HPDF       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 19U),                        /*!< HPDF clock */
    RCU_SPI4       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 20U),                        /*!< SPI4 clock */
    RCU_SPI5       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 21U),                        /*!< SPI5 clock */
    RCU_SAI0       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 22U),                        /*!< SAI0 clock */
    RCU_SAI1       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 23U),                        /*!< SAI1 clock */
    RCU_SAI2       = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 24U),                        /*!< SAI2 clock */
    RCU_TIMER40    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 25U),                        /*!< TIMER40 clock */
    RCU_TIMER41    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 26U),                        /*!< TIMER41 clock */
    RCU_TIMER42    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 27U),                        /*!< TIMER42 clock */
    RCU_TIMER43    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 28U),                        /*!< TIMER43 clock */
    RCU_TIMER44    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 29U),                        /*!< TIMER44 clock */
    RCU_EDOUT      = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 30U),                        /*!< EDOUT clock */
    RCU_TRIGSEL    = RCU_REGIDX_BIT(APB2EN_REG_OFFSET, 31U),                        /*!< TRIGSEL clock */
    /* APB3 peripherals */
    RCU_TLI        = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 0U),                         /*!< TLI clock */
    RCU_WWDGT      = RCU_REGIDX_BIT(APB3EN_REG_OFFSET, 1U),                         /*!< WWDGT clock */
    /* APB4 peripherals */
    RCU_SYSCFG     = RCU_REGIDX_BIT(APB4EN_REG_OFFSET, 0U),                         /*!< SYSCFG  clock */
    RCU_CMP        = RCU_REGIDX_BIT(APB4EN_REG_OFFSET, 1U),                         /*!< CMP clock */
    RCU_VREF       = RCU_REGIDX_BIT(APB4EN_REG_OFFSET, 2U),                         /*!< VREF clock */
    RCU_LPDTS      = RCU_REGIDX_BIT(APB4EN_REG_OFFSET, 3U),                         /*!< LPDTS clock */
    RCU_PMU        = RCU_REGIDX_BIT(APB4EN_REG_OFFSET, 4U),                         /*!< PMU clock */
    /* BDCTL peripherals */
    RCU_RTC        = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 15U),                         /*!< RTC clock */
    /* APB additional peripherals */
    RCU_CAN0       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 0U),                     /*!< CAN0 clock */
    RCU_CAN1       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 1U),                     /*!< CAN1 clock */
    RCU_CAN2       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 2U),                     /*!< CAN2 clock */
    RCU_AFMT       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 16U),                    /*!< AFMT clock */
    RCU_TFMT       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 17U),                    /*!< TFMT clock */
    RCU_ENDAT      = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 18U),                    /*!< ENDAT clock */
    RCU_BISS       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 19U),                    /*!< BISS clock */
    RCU_HDSL       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 20U),                    /*!< HDSL clock */
    RCU_RDCM       = RCU_REGIDX_BIT(ADD_APB2EN_REG_OFFSET, 21U)                     /*!< RDCM clock */
} rcu_periph_enum;

