RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* NVMC ECNVM clock source selection */
#define CFG1_NVMC_ECNVMSEL(regval)   (BITS(6,7) & ((uint32_t)(regval) << 6U))
#define RCU_NVMC_ECNVMSRC_AHB        CFG1_NVMC_ECNVMSEL(0)                          /*!< NVMC ECNVM select CK_AHB */
#define RCU_NVMC_ECNVMSRC_AHB_DIV2   CFG1_NVMC_ECNVMSEL(1)                          /*!< NVMC ECNVM select CK_AHB /2 */
#define RCU_NVMC_ECNVMSRC_PLL1R      CFG1_NVMC_ECNVMSEL(2)                          /*!< NVMC ECNVM select CK_PLL1R */
#define RCU_NVMC_ECNVMSRC_PLL2R      CFG1_NVMC_ECNVMSEL(3)                          /*!< NVMC ECNVM select CK_PLL2R */

/* ESC clock division selection */
#define CFG1_ESCDIV(regval)          (BITS(26,28) & ((uint32_t)(regval) << 26U))
#define RCU_ESC_DIV1                 CFG1_ESCDIV(0)                                 /*!< ESC clock division factor is 1 */
#define RCU_ESC_DIV2                 CFG1_ESCDIV(1)                                 /*!< ESC clock division factor is 2 */
#define RCU_ESC_DIV3                 CFG1_ESCDIV(2)                                 /*!< ESC clock division factor is 3 */
#define RCU_ESC_DIV4                 CFG1_ESCDIV(3)                                 /*!< ESC clock division factor is 4 */
#define RCU_ESC_DIV5                 CFG1_ESCDIV(4)                                 /*!< ESC clock division factor is 5 */
#define RCU_ESC_DIV6                 CFG1_ESCDIV(5)                                 /*!< ESC clock division factor is 6 */
#define RCU_ESC_DIV7                 CFG1_ESCDIV(6)                                 /*!< ESC clock division factor is 7 */
#define RCU_ESC_DIV8                 CFG1_ESCDIV(7)                                 /*!< ESC clock division factor is 8 */

/* ESC clock source selection */
#define CFG1_ESCSEL(regval)          (BITS(29,30) & ((uint32_t)(regval) << 29U))
#define RCU_ESCSRC_AHB               CFG1_ESCSEL(0)                                 /*!< ESC select CK_AHB */
#define RCU_ESCSRC_PLL0R             CFG1_ESCSEL(1)                                 /*!< ESC select CK_PLL0R */
#define RCU_ESCSRC_PLL1P             CFG1_ESCSEL(2)                                 /*!< ESC select CK_PLL1P */
#define RCU_ESCSRC_PLL2Q             CFG1_ESCSEL(3)                                 /*!< ESC select I2S_PLL2Q */

/* OSPI clock source selection */
#define CFG4_OSPISEL(regval)         (BITS(1,2) & ((uint32_t)(regval) << 1U))
#define RCU_OSPI_AHB                 CFG4_OSPISEL(0)                                /*!< OSPI select CK_AHB */
#define RCU_OSPI_PLL0Q               CFG4_OSPISEL(1)                                /*!< OSPI select CK_PLL0Q */
#define RCU_OSPI_PLL1R               CFG4_OSPISEL(2)                                /*!< OSPI select CK_PLL1R */
#define RCU_OSPI_IRC64MDIV           CFG4_OSPISEL(3)                                /*!< OSPI select CK_IRC64MDIV */

/* ENCODER clock source selection */
#define CFG6_ENCODERSEL(regval)      (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_ENCODER_SYS              CFG6_ENCODERSEL(0)                             /*!< ENCODER select CK_SYS */
#define RCU_ENCODER_PLL0Q            CFG6_ENCODERSEL(1)                             /*!< ENCODER select CK_PLL0Q */
#define RCU_ENCODER_PLL1R            CFG6_ENCODERSEL(2)                             /*!< ENCODER select CK_PLL1R */
#define RCU_ENCODER_PLL2R            CFG6_ENCODERSEL(3)                             /*!< ENCODER select CK_PLL2R */

/* HDSL clock source selection */
#define CFG6_HDSLSEL(regval)         (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define RCU_HDSL_SYS                 CFG6_HDSLSEL(0)                                /*!< HDSL select CK_SYS */
#define RCU_HDSL_PLL0R               CFG6_HDSLSEL(1)                                /*!< HDSL select CK_PLL0R */
#define RCU_HDSL_PLL1P               CFG6_HDSLSEL(2)                                /*!< HDSL select CK_PLL1P */
#define RCU_HDSL_PLL2Q               CFG6_HDSLSEL(3)                                /*!< HDSL select CK_PLL2Q */

/* AFMT clock source division selection */
#define CFG6_AFMTDIV(regval)         (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define RCU_AFMT_DIV1                CFG6_AFMTDIV(0)                                /*!< AFMT clock division factor is 1 */
#define RCU_AFMT_DIV2                CFG6_AFMTDIV(1)                                /*!< AFMT clock division factor is 2 */
#define RCU_AFMT_DIV3                CFG6_AFMTDIV(2)                                /*!< AFMT clock division factor is 3 */
#define RCU_AFMT_DIV4                CFG6_AFMTDIV(3)                                /*!< AFMT clock division factor is 4 */
#define RCU_AFMT_DIV5                CFG6_AFMTDIV(4)                                /*!< AFMT clock division factor is 5 */
#define RCU_AFMT_DIV6                CFG6_AFMTDIV(5)                                /*!< AFMT clock division factor is 6 */
#define RCU_AFMT_DIV7                CFG6_AFMTDIV(6)                                /*!< AFMT clock division factor is 7 */
#define RCU_AFMT_DIV8                CFG6_AFMTDIV(7)                                /*!< AFMT clock division factor is 8 */
#define RCU_AFMT_DIV9                CFG6_AFMTDIV(8)                                /*!< AFMT clock division factor is 9 */
#define RCU_AFMT_DIV10               CFG6_AFMTDIV(9)                                /*!< AFMT clock division factor is 10 */
#define RCU_AFMT_DIV11               CFG6_AFMTDIV(10)                               /*!< AFMT clock division factor is 11 */
#define RCU_AFMT_DIV12               CFG6_AFMTDIV(11)                               /*!< AFMT clock division factor is 12 */
#define RCU_AFMT_DIV13               CFG6_AFMTDIV(12)                               /*!< AFMT clock division factor is 13 */
#define RCU_AFMT_DIV14               CFG6_AFMTDIV(13)                               /*!< AFMT clock division factor is 14 */
#define RCU_AFMT_DIV15               CFG6_AFMTDIV(14)                               /*!< AFMT clock division factor is 15 */
#define RCU_AFMT_DIV16               CFG6_AFMTDIV(15)                               /*!< AFMT clock division factor is 16 */

/* TFMT clock source division selection */
#define CFG6_TFMTDIV(regval)         (BITS(8,11) & ((uint32_t)(regval) << 8U))
#define RCU_TFMT_DIV1                CFG6_TFMTDIV(0)                                /*!< TFMT clock division factor is 1 */
#define RCU_TFMT_DIV2                CFG6_TFMTDIV(1)                                /*!< TFMT clock division factor is 2 */
#define RCU_TFMT_DIV3                CFG6_TFMTDIV(2)                                /*!< TFMT clock division factor is 3 */
#define RCU_TFMT_DIV4                CFG6_TFMTDIV(3)                                /*!< TFMT clock division factor is 4 */
#define RCU_TFMT_DIV5                CFG6_TFMTDIV(4)                                /*!< TFMT clock division factor is 5 */
#define RCU_TFMT_DIV6                CFG6_TFMTDIV(5)                                /*!< TFMT clock division factor is 6 */
#define RCU_TFMT_DIV7                CFG6_TFMTDIV(6)                                /*!< TFMT clock division factor is 7 */
#define RCU_TFMT_DIV8                CFG6_TFMTDIV(7)                                /*!< TFMT clock division factor is 8 */
#define RCU_TFMT_DIV9                CFG6_TFMTDIV(8)                                /*!< TFMT clock division factor is 9 */
#define RCU_TFMT_DIV10               CFG6_TFMTDIV(9)                                /*!< TFMT clock division factor is 10 */
#define RCU_TFMT_DIV11               CFG6_TFMTDIV(10)                               /*!< TFMT clock division factor is 11 */
#define RCU_TFMT_DIV12               CFG6_TFMTDIV(11)                               /*!< TFMT clock division factor is 12 */
#define RCU_TFMT_DIV13               CFG6_TFMTDIV(12)                               /*!< TFMT clock division factor is 13 */
#define RCU_TFMT_DIV14               CFG6_TFMTDIV(13)                               /*!< TFMT clock division factor is 14 */
#define RCU_TFMT_DIV15               CFG6_TFMTDIV(14)                               /*!< TFMT clock division factor is 15 */
#define RCU_TFMT_DIV16               CFG6_TFMTDIV(15)                               /*!< TFMT clock division factor is 16 */

/* ENDAT clock source division selection */
#define CFG6_ENDATDIV(regval)        (BITS(12,15) & ((uint32_t)(regval) << 12U))
#define RCU_ENDAT_DIV1               CFG6_ENDATDIV(0)                               /*!< ENDAT clock division factor is 1 */
#define RCU_ENDAT_DIV2               CFG6_ENDATDIV(1)                               /*!< ENDAT clock division factor is 2 */
#define RCU_ENDAT_DIV3               CFG6_ENDATDIV(2)                               /*!< ENDAT clock division factor is 3 */
#define RCU_ENDAT_DIV4               CFG6_ENDATDIV(3)                               /*!< ENDAT clock division factor is 4 */
#define RCU_ENDAT_DIV5               CFG6_ENDATDIV(4)                               /*!< ENDAT clock division factor is 5 */
#define RCU_ENDAT_DIV6               CFG6_ENDATDIV(5)                               /*!< ENDAT clock division factor is 6 */
#define RCU_ENDAT_DIV7               CFG6_ENDATDIV(6)                               /*!< ENDAT clock division factor is 7 */
#define RCU_ENDAT_DIV8               CFG6_ENDATDIV(7)                               /*!< ENDAT clock division factor is 8 */
#define RCU_ENDAT_DIV9               CFG6_ENDATDIV(8)                               /*!< ENDAT clock division factor is 9 */
#define RCU_ENDAT_DIV10              CFG6_ENDATDIV(9)                               /*!< ENDAT clock division factor is 10 */
#define RCU_ENDAT_DIV11              CFG6_ENDATDIV(10)                              /*!< ENDAT clock division factor is 11 */
#define RCU_ENDAT_DIV12              CFG6_ENDATDIV(11)                              /*!< ENDAT clock division factor is 12 */
#define RCU_ENDAT_DIV13              CFG6_ENDATDIV(12)                              /*!< ENDAT clock division factor is 13 */
#define RCU_ENDAT_DIV14              CFG6_ENDATDIV(13)                              /*!< ENDAT clock division factor is 14 */
#define RCU_ENDAT_DIV15              CFG6_ENDATDIV(14)                              /*!< ENDAT clock division factor is 15 */
#define RCU_ENDAT_DIV16              CFG6_ENDATDIV(15)                              /*!< ENDAT clock division factor is 16 */

/* HDSL clock source division selection */
#define CFG6_HDSLDIV(regval)        (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_HDSL_DIV1               CFG6_HDSLDIV(0)                                 /*!< HDSL clock division factor is 1 */
#define RCU_HDSL_DIV2               CFG6_HDSLDIV(1)                                 /*!< HDSL clock division factor is 2 */
#define RCU_HDSL_DIV3               CFG6_HDSLDIV(2)                                 /*!< HDSL clock division factor is 3 */
#define RCU_HDSL_DIV4               CFG6_HDSLDIV(3)                                 /*!< HDSL clock division factor is 4 */
#define RCU_HDSL_DIV5               CFG6_HDSLDIV(4)                                 /*!< HDSL clock division factor is 5 */
#define RCU_HDSL_DIV6               CFG6_HDSLDIV(5)                                 /*!< HDSL clock division factor is 6 */
#define RCU_HDSL_DIV7               CFG6_HDSLDIV(6)                                 /*!< HDSL clock division factor is 7 */
#define RCU_HDSL_DIV8               CFG6_HDSLDIV(7)                                 /*!< HDSL clock division factor is 8 */

/* HPDF clock source selection */
#define RCU_HPDFSRC_APB2             (uint32_t)(0X00000000U)                        /*!< CK_HPDF select CK_APB2 */
#define RCU_HPDFSRC_AHB              RCU_CFG1_HPDFSEL                               /*!< CK_HPDF select CK_AHB */

/* PER clock selection */
#define CFG1_PERSEL(regval)          (BITS(14,15) & ((uint32_t)(regval) << 14U))
#define RCU_PERSRC_IRC64MDIV         CFG1_PERSEL(0)                                 /*!< CK_PER select CK_IRC64MDIV */
#define RCU_PERSRC_LPIRC4M           CFG1_PERSEL(1)                                 /*!< CK_PER select CK_LPIRC4M */
#define RCU_PERSRC_HXTAL             CFG1_PERSEL(2)                                 /*!< CK_PER select CK_HXTAL */

