RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* CKOUT0 Clock source selection */
#define CFG2_CKOUT0SEL(regval)       (BITS(4,6) & ((uint32_t)(regval) << 4U))
#define RCU_CKOUT0SRC_IRC64MDIV      CFG2_CKOUT0SEL(0)                              /*!< internal 64MDIV RC oscillator clock selected */
#define RCU_CKOUT0SRC_LXTAL          CFG2_CKOUT0SEL(1)                              /*!< low speed crystal oscillator clock (LXTAL) selected */
#define RCU_CKOUT0SRC_HXTAL          CFG2_CKOUT0SEL(2)                              /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUT0SRC_PLL0P          CFG2_CKOUT0SEL(3)                              /*!< CK_PLL0P clock selected */
#define RCU_CKOUT0SRC_IRC48M         CFG2_CKOUT0SEL(4)                              /*!< CK_IRC48M clock selected */
#define RCU_CKOUT0SRC_PER            CFG2_CKOUT0SEL(5)                              /*!< CK_PER clock selected */
#define RCU_CKOUT0SRC_USBHS060M      CFG2_CKOUT0SEL(6)                              /*!< USBHS0 60M clock selected */

/* The CK_OUT1 divider */
#define CFG2_CKOUT1DIV(regval)       (BITS(8,11) & ((uint32_t)(regval) << 8U))
#define RCU_CKOUT1_DIV1              CFG2_CKOUT1DIV(1)                              /*!< CK_OUT1 is divided by 1 */
#define RCU_CKOUT1_DIV2              CFG2_CKOUT1DIV(2)                              /*!< CK_OUT1 is divided by 2 */
#define RCU_CKOUT1_DIV3              CFG2_CKOUT1DIV(3)                              /*!< CK_OUT1 is divided by 3 */
#define RCU_CKOUT1_DIV4              CFG2_CKOUT1DIV(4)                              /*!< CK_OUT1 is divided by 4 */
#define RCU_CKOUT1_DIV5              CFG2_CKOUT1DIV(5)                              /*!< CK_OUT1 is divided by 5 */
#define RCU_CKOUT1_DIV6              CFG2_CKOUT1DIV(6)                              /*!< CK_OUT1 is divided by 6 */
#define RCU_CKOUT1_DIV7              CFG2_CKOUT1DIV(7)                              /*!< CK_OUT1 is divided by 7 */
#define RCU_CKOUT1_DIV8              CFG2_CKOUT1DIV(8)                              /*!< CK_OUT1 is divided by 8 */
#define RCU_CKOUT1_DIV9              CFG2_CKOUT1DIV(9)                              /*!< CK_OUT1 is divided by 9 */
#define RCU_CKOUT1_DIV10             CFG2_CKOUT1DIV(10)                             /*!< CK_OUT1 is divided by 10 */
#define RCU_CKOUT1_DIV11             CFG2_CKOUT1DIV(11)                             /*!< CK_OUT1 is divided by 11 */
#define RCU_CKOUT1_DIV12             CFG2_CKOUT1DIV(12)                             /*!< CK_OUT1 is divided by 12 */
#define RCU_CKOUT1_DIV13             CFG2_CKOUT1DIV(13)                             /*!< CK_OUT1 is divided by 13 */
#define RCU_CKOUT1_DIV14             CFG2_CKOUT1DIV(14)                             /*!< CK_OUT1 is divided by 14 */
#define RCU_CKOUT1_DIV15             CFG2_CKOUT1DIV(15)                             /*!< CK_OUT1 is divided by 15 */

/* CKOUT1 Clock source selection */
#define CFG2_CKOUT1SEL(regval)       (BITS(12,14) & ((uint32_t)(regval) << 12U))
#define RCU_CKOUT1SRC_SYSTEMCLOCK    CFG2_CKOUT1SEL(0)                              /*!< system clock selected */
#define RCU_CKOUT1SRC_PLL1R          CFG2_CKOUT1SEL(1)                              /*!< CK_PLL1R clock selected */
#define RCU_CKOUT1SRC_HXTAL          CFG2_CKOUT1SEL(2)                              /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUT1SRC_PLL0P          CFG2_CKOUT1SEL(3)                              /*!< CK_PLL0P clock selected */
#define RCU_CKOUT1SRC_LPIRC4M        CFG2_CKOUT1SEL(4)                              /*!< CK_LPIRC4M clock selected */
#define RCU_CKOUT1SRC_IRC32K         CFG2_CKOUT1SEL(5)                              /*!< CK_IRC32K clock selected */
#define RCU_CKOUT1SRC_PLL2R          CFG2_CKOUT1SEL(6)                              /*!< CK_PLL2R clock selected */

/* the divider factor from PLL2R clock */
#define CFG1_PLL2RDIV(regval)        (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define RCU_PLL2R_DIV2               CFG1_PLL2RDIV(0)                               /*!< CK_PLL2RDIV clock select CK_PLL2R / 2 */
#define RCU_PLL2R_DIV4               CFG1_PLL2RDIV(1)                               /*!< CK_PLL2RDIV clock select CK_PLL2R / 4 */
#define RCU_PLL2R_DIV8               CFG1_PLL2RDIV(2)                               /*!< CK_PLL2RDIV clock select CK_PLL2R / 8 */
#define RCU_PLL2R_DIV16              CFG1_PLL2RDIV(3)                               /*!< CK_PLL2RDIV clock select CK_PLL2R / 16 */

/* TIMER clock selection */
#define RCU_TIMER_PSC_MUL2           ((uint32_t)(~RCU_CFG1_TIMERSEL))               /*!< if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB)
                                                                                            or 0b100(CK_APBx = CK_AHB/2), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                                                                            or else, the TIMER clock is twice the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 2 x CK_APB1;
                                                                                            TIMER in APB2 domain: CK_TIMERx = 2 x CK_APB2) */
#define RCU_TIMER_PSC_MUL4           RCU_CFG1_TIMERSEL                              /*!< if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB),
                                                                                            0b100(CK_APBx = CK_AHB/2), or 0b101(CK_APBx = CK_AHB/4), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                                                                            or else, the TIMER clock is four timers the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 4 x CK_APB1;
                                                                                            TIMER in APB2 domain: CK_TIMERx = 4 x CK_APB2) */

/* RCU_PLL0 register bit define */
/* The PLL0 VCO source clock prescaler */
#define RCU_PLL0PSC_DIV_MIN          ((uint32_t)1U)                                 /*!< PLL0PSC_DIV min value */
#define RCU_PLL0PSC_DIV_MAX          ((uint32_t)63U)                                /*!< PLL0PSC_DIV max value */

