RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* USBHS prescaler factor */
#define USBCLKCTL_USBHSPSC(regval)        (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_USBHSPSC_DIV1                 USBCLKCTL_USBHSPSC(0)                     /*!< USBHS prescaler select CK_PLL1Q / 1 */
#define RCU_USBHSPSC_DIV2                 USBCLKCTL_USBHSPSC(1)                     /*!< USBHS prescaler select CK_PLL1Q / 2 */
#define RCU_USBHSPSC_DIV3                 USBCLKCTL_USBHSPSC(2)                     /*!< USBHS prescaler select CK_PLL1Q / 3 */
#define RCU_USBHSPSC_DIV4                 USBCLKCTL_USBHSPSC(3)                     /*!< USBHS prescaler select CK_PLL1Q / 4 */
#define RCU_USBHSPSC_DIV5                 USBCLKCTL_USBHSPSC(4)                     /*!< USBHS prescaler select CK_PLL1Q / 5 */
#define RCU_USBHSPSC_DIV6                 USBCLKCTL_USBHSPSC(5)                     /*!< USBHS prescaler select CK_PLL1Q / 6 */
#define RCU_USBHSPSC_DIV7                 USBCLKCTL_USBHSPSC(6)                     /*!< USBHS prescaler select CK_PLL1Q / 7 */
#define RCU_USBHSPSC_DIV8                 USBCLKCTL_USBHSPSC(7)                     /*!< USBHS prescaler select CK_PLL1Q / 8 */

/* USBHS 48MHz clock selection */
#define USBCLKCTL_USB48MSEL(regval)       (BITS(5,6) & ((uint32_t)(regval) << 5U))
#define RCU_USB48MSRC_PLL0R               USBCLKCTL_USB48MSEL(0)                    /*!< select PLL0R as USBHS 48MHz clock source */
#define RCU_USB48MSRC_PLLUSBHS            USBCLKCTL_USB48MSEL(1)                    /*!< select PLLUSBHS / USBHSDV as USBHS 48MHz clock source */
#define RCU_USB48MSRC_PLL1Q               USBCLKCTL_USB48MSEL(2)                    /*!< select PLL1Q / USBHSPSC as USBHS 48MHz clock source */
#define RCU_USB48MSRC_IRC48M              USBCLKCTL_USB48MSEL(3)                    /*!< select IRC48M as USBHS 48MHz clock source */

/* IRC64M clock frequency monitor configuration */
#define CKFMCFG0_IRC64MCKFMC(range)       (BITS(1,2) & ((uint32_t)(range) << 1U))
#define RCU_IRC64MCKFMC_5_PERCENT         CKFMCFG0_IRC64MCKFMC(0)                   /*!< the IRC64M clock frequency monitoring range is ±5% */
#define RCU_IRC64MCKFMC_10_PERCENT        CKFMCFG0_IRC64MCKFMC(1)                   /*!< the IRC64M clock frequency monitoring range is ±10% */
#define RCU_IRC64MCKFMC_15_PERCENT        CKFMCFG0_IRC64MCKFMC(2)                   /*!< the IRC64M clock frequency monitoring range is ±15% */
#define RCU_IRC64MCKFMC_20_PERCENT        CKFMCFG0_IRC64MCKFMC(3)                   /*!< the IRC64M clock frequency monitoring range is ±20% */

/* LPIRC4M clock frequency monitor configuration */
#define CKFMCFG0_LPIRC4MCKFMC(range)      (BITS(17,18) & ((uint32_t)(range) << 17U))
#define RCU_LPIRC4MCKFMC_5_PERCENT        CKFMCFG0_LPIRC4MCKFMC(0)                 /*!< the LPIRC4M clock frequency monitoring range is ±5% */
#define RCU_LPIRC4MCKFMC_10_PERCENT       CKFMCFG0_LPIRC4MCKFMC(1)                 /*!< the LPIRC4M clock frequency monitoring range is ±10% */
#define RCU_LPIRC4MCKFMC_15_PERCENT       CKFMCFG0_LPIRC4MCKFMC(2)                 /*!< the LPIRC4M clock frequency monitoring range is ±15% */
#define RCU_LPIRC4MCKFMC_20_PERCENT       CKFMCFG0_LPIRC4MCKFMC(3)                 /*!< the LPIRC4M clock frequency monitoring range is ±20% */

/* LXTAL start circuit control */
#define RCU_LXTAL_START_CIRCUIT_CLOSE     0x00000000U                              /*!< close the start circuit when LXTAL is ready */
#define RCU_LXTAL_START_CIRCUIT_HOLD      RCU_BDCTL_LXTALSTARTON                   /*!< hold the start circuit when LXTAL is ready */

/* DSI preceding stage clock source selection */
#define RCU_DSIPRESEL_IRC64MDIV           0x00000000U                              /*!< CK_IRC64MDIV selected as DSI preceding stage source clock */
#define RCU_DSIPRESEL_HXTAL               RCU_CFG1_DSIPRESEL                       /*!< CK_HXTAL selected as DSI preceding stage source clock */

/* DSI clock source division selection */
#define CFG3_DSIDIV(regval)               (BITS(6,9) & ((uint32_t)(regval) << 6U))
#define RCU_DSI_DIV1                      CFG3_DSIDIV(0)                           /*!< DSI clock division factor is 1 */
#define RCU_DSI_DIV2                      CFG3_DSIDIV(1)                           /*!< DSI clock division factor is 2 */
#define RCU_DSI_DIV3                      CFG3_DSIDIV(2)                           /*!< DSI clock division factor is 3 */
#define RCU_DSI_DIV4                      CFG3_DSIDIV(3)                           /*!< DSI clock division factor is 4 */
#define RCU_DSI_DIV5                      CFG3_DSIDIV(4)                           /*!< DSI clock division factor is 5 */
#define RCU_DSI_DIV6                      CFG3_DSIDIV(5)                           /*!< DSI clock division factor is 6 */
#define RCU_DSI_DIV7                      CFG3_DSIDIV(6)                           /*!< DSI clock division factor is 7 */
#define RCU_DSI_DIV8                      CFG3_DSIDIV(7)                           /*!< DSI clock division factor is 8 */
#define RCU_DSI_DIV9                      CFG3_DSIDIV(8)                           /*!< DSI clock division factor is 9 */
#define RCU_DSI_DIV10                     CFG3_DSIDIV(9)                           /*!< DSI clock division factor is 10 */
#define RCU_DSI_DIV11                     CFG3_DSIDIV(10)                          /*!< DSI clock division factor is 11 */
#define RCU_DSI_DIV12                     CFG3_DSIDIV(11)                          /*!< DSI clock division factor is 12 */
#define RCU_DSI_DIV13                     CFG3_DSIDIV(12)                          /*!< DSI clock division factor is 13 */
#define RCU_DSI_DIV14                     CFG3_DSIDIV(13)                          /*!< DSI clock division factor is 14 */
#define RCU_DSI_DIV15                     CFG3_DSIDIV(14)                          /*!< DSI clock division factor is 15 */
#define RCU_DSI_DIV16                     CFG3_DSIDIV(15)                          /*!< DSI clock division factor is 16 */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check RCU PLL PSC */
#define NOT_RCU_PLLPS(pll_psc)             ((pll_psc) == 0U)
/* check RCU PLL P/Q/R */
#define NOT_RCU_PLLPQR(pll_pqr)            ((pll_pqr) == 0U)
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* peripherals clock configure functions */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* enable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph);
/* disable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripheral */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);
/* reset the BKP */
void rcu_bkp_reset_enable(void);
/* disable the BKP reset */
void rcu_bkp_reset_disable(void);
/* reset the HXTAL ready */
void rcu_hxtal_ready_reset_enable(void);
/* disable the HXTAL ready reset */
void rcu_hxtal_ready_reset_disable(void);
/* reset the LXTAL ready */
void rcu_lxtal_ready_reset_enable(void);
/* disable the LXTAL ready reset */
void rcu_lxtal_ready_reset_disable(void);
/* LXTAL start circuit control */
void rcu_lxtal_start_circuit_control(uint32_t control);

/* system and peripherals clock source, system reset configure functions */
/* configure the system clock source */
void rcu_system_clock_source_config(uint32_t ck_sys);
/* get the system clock source */
uint32_t rcu_system_clock_source_get(void);
/* configure the AHB clock prescaler selection */
void rcu_ahb_clock_config(uint32_t ck_ahb);
/* configure the APB1 clock prescaler selection */
void rcu_apb1_clock_config(uint32_t ck_apb1);
/* configure the APB2 clock prescaler selection */
void rcu_apb2_clock_config(uint32_t ck_apb2);
/* configure the APB3 clock prescaler selection */
void rcu_apb3_clock_config(uint32_t ck_apb3);
/* configure the APB4 clock prescaler selection */
void rcu_apb4_clock_config(uint32_t ck_apb4);
/* configure the CK_OUT0 clock source and divider */
void rcu_ckout0_config(uint32_t ckout0_src, uint32_t ckout0_div);
/* configure the CK_OUT1 clock source and divider */
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout1_div);

