RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_rcu.h
/* clock frequency monitor configure functions */
/* enable the clock frequency monitor */
void rcu_clock_freq_monitor_enable(rcu_ckfm_enum ckfm);
/* disable the clock frequency monitor */
void rcu_clock_freq_monitor_disable(rcu_ckfm_enum ckfm);
/* IRC64M clock frequency monitor range configuration */
void rcu_irc64m_freq_monitor_config(uint32_t range);
/* LPIRC4M clock frequency monitor range configuration */
void rcu_lpirc4m_freq_monitor_config(uint32_t range);
/* HXTAL clock frequency monitor threshold configuration */
void rcu_hxtal_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold);
/* PLL0P clock frequency monitor threshold configuration */
void rcu_pll0p_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold);

/* clock frequency get functions */
/* get the system clock, bus and peripheral clock frequency */
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock);

/* flag & interrupt functions */
/* get the clock stabilization and failure, peripheral reset and clock frequency failure flags */
FlagStatus rcu_flag_get(rcu_flag_enum flag);
/* clear clock frequency failure flags */
void rcu_flag_clear(rcu_flag_clear_enum flag);
/* clear all the reset flag */
void rcu_all_reset_flag_clear(void);
/* enable the clock stabilization and frequency failure interrupt */
void rcu_interrupt_enable(rcu_int_enum interrupt);
/* disable the clock stabilization and frequency failure interrupt */
void rcu_interrupt_disable(rcu_int_enum interrupt);
/* get the clock stabilization and stuck interrupt flags */
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag);
/* clear the clock stabilization and stuck interrupt flags */
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag);

#endif /* GD32H77X_78X_RCU_H */
